ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
// SPDX-License-Identifier: LGPL-3.0-or-later
// Copyright 2016-2026 Hristo Gochkov, Mathieu Carbou, Emil Muratov, Will Miles

#include "AsyncWebSocket.h"
#include "AsyncWebServerLogging.h"

#include <libb64/cencode.h>

#if defined(ESP32)
#if ESP_IDF_VERSION_MAJOR < 5
#include "BackPort_SHA1Builder.h"
#else
#include <SHA1Builder.h>
#endif
#include <rom/ets_sys.h>
#elif defined(TARGET_RP2040) || defined(TARGET_RP2350) || defined(PICO_RP2040) || defined(PICO_RP2350) || defined(ESP8266)
#include <Hash.h>
#elif defined(LIBRETINY)
#include <mbedtls/sha1.h>
#elif defined(HOST)
#include "BackPort_SHA1Builder.h"
#ifndef FPSTR
#define FPSTR (const char *)
#endif
#endif

#include <algorithm>
#include <cstdio>
#include <cstring>
#include <memory>
#include <utility>
#include <cstdarg>

#define STATE_FRAME_START 0
#define STATE_FRAME_MASK  1
#define STATE_FRAME_DATA  2

// Sentinel returned by webSocketSendFrame() when a torn frame is detected
// (partial add() after header committed, or header add() / malloc failure).
// Distinct from 0, which means "busy, try again later". The caller must not
// roll back its send offset and must schedule a connection close.
constexpr size_t WS_FRAME_TORN = static_cast<size_t>(-1);

using namespace asyncsrv;

size_t webSocketSendFrameWindow(AsyncClient *client) {
  if (!client || !client->canSend()) {
    return 0;
  }
  size_t space = client->space();
  if (space < 9) {
    return 0;
  }
  return space - 8;
}

size_t webSocketSendFrame(AsyncClient *client, bool final, uint8_t opcode, bool mask, uint8_t *data, size_t len) {
  if (!client || !client->canSend()) {
    // Serial.println("SF 1");
    return 0;
  }
  size_t space = client->space();
  if (space < 2) {
    // Serial.println("SF 2");
    return 0;
  }
  uint8_t mbuf[4] = {0, 0, 0, 0};
  uint8_t headLen = 2;
  if (len && mask) {
    headLen += 4;
    mbuf[0] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
    mbuf[1] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
    mbuf[2] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
    mbuf[3] = rand() % 0xFF;  // NOLINT(runtime/threadsafe_fn)
  }
  if (len > 125) {
    headLen += 2;
  }
  if (space < headLen) {
    // Serial.println("SF 2");
    return 0;
  }
  space -= headLen;

  if (len > space) {
    len = space;
  }

  uint8_t *buf = (uint8_t *)malloc(headLen);
  if (buf == NULL) {
    async_ws_log_e("Failed to allocate");
    // Nothing is on the wire yet. Signal hard error so the caller closes
    // via the safe onDisconnect path (abort() leaks: no onDisconnect fires).
    return WS_FRAME_TORN;
  }

  buf[0] = opcode & 0x0F;
  if (final) {
    buf[0] |= 0x80;
  }
  if (len < 126) {
    buf[1] = len & 0x7F;
  } else {
    buf[1] = 126;
    buf[2] = (uint8_t)((len >> 8) & 0xFF);
    buf[3] = (uint8_t)(len & 0xFF);
  }
  if (len && mask) {
    buf[1] |= 0x80;
    memcpy(buf + (headLen - 4), mbuf, 4);
  }
  if (client->add((const char *)buf, headLen) != headLen) {
    free(buf);
    // Header could not be fully committed; nothing usable is on the wire.
    // Signal hard error so the caller closes via the safe onDisconnect path
    // (abort() leaks: no onDisconnect fires on ESP32 or ESP8266).
    return WS_FRAME_TORN;
  }
  free(buf);

  if (len) {
    if (len && mask) {
      size_t i;
      for (i = 0; i < len; i++) {
        data[i] = data[i] ^ mbuf[i % 4];
      }
    }
    if (client->add((const char *)data, len) != len) {
      // The header is already committed but the payload was only partially
      // accepted (lwIP segment exhaustion under load). The stream is now
      // unrecoverable. Returning 0 would make the caller roll back its offset
      // and re-send with a NEW frame header injected mid-payload. Signal hard
      // error so the caller closes via the safe onDisconnect path (abort()
      // leaks: no onDisconnect fires on ESP32 or ESP8266).
      return WS_FRAME_TORN;
    }
  }
  // A failing send() is not an error: the frame is fully queued in lwIP and
  // will be flushed by the next poll/ack cycle. Returning 0 here caused a
  // rollback and a duplicate re-send of already-queued bytes.
  client->send();
  return len;
}

size_t AsyncWebSocketControl::send(AsyncClient *client) {
  _finished = true;
  return webSocketSendFrame(client, true, _opcode & 0x0F, _mask, _data, _len);
}

/*
 *    AsyncWebSocketMessageBuffer
 */

AsyncWebSocketMessageBuffer::AsyncWebSocketMessageBuffer(const uint8_t *data, size_t size) : _buffer(std::make_shared<std::vector<uint8_t>>(size)) {
  if (_buffer->capacity() < size) {
    _buffer->reserve(size);
  } else {
    std::memcpy(_buffer->data(), data, size);
  }
}

AsyncWebSocketMessageBuffer::AsyncWebSocketMessageBuffer(size_t size) : _buffer(std::make_shared<std::vector<uint8_t>>(size)) {
  if (_buffer->capacity() < size) {
    _buffer->reserve(size);
  }
}

bool AsyncWebSocketMessageBuffer::reserve(size_t size) {
  if (_buffer->capacity() >= size) {
    return true;
  }
  _buffer->reserve(size);
  return _buffer->capacity() >= size;
}

/*
 * AsyncWebSocketMessage Message
 */

AsyncWebSocketMessage::AsyncWebSocketMessage(AsyncWebSocketSharedBuffer buffer, uint8_t opcode, bool mask)
  : _WSbuffer{buffer}, _opcode(opcode & 0x07), _mask{mask}, _status{_WSbuffer ? WS_MSG_SENDING : WS_MSG_ERROR} {}

size_t AsyncWebSocketMessage::ack(size_t len, uint32_t time) {
  (void)time;
  const size_t pending = std::min(len, _ack - _acked);
  _acked += pending;
  if (_sent >= _WSbuffer->size() && _acked >= _ack) {
    _status = WS_MSG_SENT;
  }
  const size_t remaining = len - pending;
  async_ws_log_v("ACK[%" PRIu8 "] %u/%u (acked: %u/%u) => %" PRIu8, _opcode, _sent, _WSbuffer->size(), _acked, _ack, static_cast<uint8_t>(_status));
  return remaining;
}

size_t AsyncWebSocketMessage::send(AsyncClient *client) {
  if (!client) {
    async_ws_log_v("No client");
    return 0;
  }

  if (_status != WS_MSG_SENDING) {
    async_ws_log_v("SEND[%" PRIu8 "] => [%" PRIu16 "] WS_MSG_SENDING != %" PRIu8, _opcode, client->remotePort(), static_cast<uint8_t>(_status));
    return 0;
  }

  if (_sent == _WSbuffer->size()) {
    if (_acked == _ack) {
      _status = WS_MSG_SENT;
    }
    async_ws_log_v("SEND[%" PRIu8 "] => [%" PRIu16 "] WS_MSG_SENT %u/%u (acked: %u/%u)", _opcode, client->remotePort(), _sent, _WSbuffer->size(), _acked, _ack);
    return 0;
  }
  if (_sent > _WSbuffer->size()) {
    _status = WS_MSG_ERROR;
    async_ws_log_v(
      "SEND[%" PRIu8 "] => [%" PRIu16 "] WS_MSG_ERROR %u/%u (acked: %u/%u)", _opcode, client->remotePort(), _sent, _WSbuffer->size(), _acked, _ack
    );
    return 0;
  }

  size_t toSend = _WSbuffer->size() - _sent;
  const size_t window = webSocketSendFrameWindow(client);

  // not enough space in lwip buffer ?
  if (!window) {
    async_ws_log_v("SEND[%" PRIu8 "] => [%" PRIu16 "] NO_SPACE %u", _opcode, client->remotePort(), toSend);
    return 0;
  }

  toSend = std::min(toSend, window);

