ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
  _sent += toSend;
  _ack += toSend + ((toSend < 126) ? 2 : 4) + (_mask * 4);

  bool final = (_sent == _WSbuffer->size());
  uint8_t *dPtr = (uint8_t *)(_WSbuffer->data() + (_sent - toSend));
  uint8_t opCode = (toSend && _sent == toSend) ? _opcode : (uint8_t)WS_CONTINUATION;

  size_t sent = webSocketSendFrame(client, final, opCode, _mask, dPtr, toSend);
  _status = WS_MSG_SENDING;
  if (sent == WS_FRAME_TORN) {
    // Torn frame: header (and possibly partial payload) is already on the wire.
    // Do NOT roll back _sent/_ack — re-sending from a rolled-back offset would
    // inject a new frame header mid-payload and corrupt the stream. Mark the
    // message errored so _runQueue schedules a safe connection close.
    _status = WS_MSG_ERROR;
    return 0;
  }
  if (toSend && sent != toSend) {
    _sent -= (toSend - sent);
    _ack -= (toSend - sent);
  }

  async_ws_log_v(
    "SEND[%" PRIu8 "] => [%" PRIu16 "] WS_MSG_SENDING %u/%u (acked: %u/%u)", _opcode, client->remotePort(), _sent, _WSbuffer->size(), _acked, _ack
  );
  return sent;
}

/*
 * Async WebSocket Client
 */
const char *AWSC_PING_PAYLOAD = "ESPAsyncWebServer-PING";
const size_t AWSC_PING_PAYLOAD_LEN = 22;

AsyncWebSocketClient::AsyncWebSocketClient(AsyncClient *client, AsyncWebSocket *server)
  : _client(client), _server(server), _clientId(_server->_getNextId()), _status(WS_CONNECTED), _pstate(STATE_FRAME_START), _lastMessageTime(millis()),
    _keepAlivePeriod(0), _tempObject(NULL) {

  _client->setRxTimeout(0);
  _client->onError(
    [](void *r, AsyncClient *c, int8_t error) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onError(error);
    },
    this
  );
  _client->onAck(
    [](void *r, AsyncClient *c, size_t len, uint32_t time) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onAck(len, time);
    },
    this
  );
  _client->onDisconnect(
    [](void *r, AsyncClient *c) {
      ((AsyncWebSocketClient *)(r))->_onDisconnect();
      delete c;
    },
    this
  );
  _client->onTimeout(
    [](void *r, AsyncClient *c, uint32_t time) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onTimeout(time);
    },
    this
  );
  _client->onData(
    [](void *r, AsyncClient *c, void *buf, size_t len) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onData(buf, len);
    },
    this
  );
  _client->onPoll(
    [](void *r, AsyncClient *c) {
      (void)c;
      ((AsyncWebSocketClient *)(r))->_onPoll();
    },
    this
  );
  memset(&_pinfo, 0, sizeof(_pinfo));
}

AsyncWebSocketClient::~AsyncWebSocketClient() {
  {
    asyncsrv::lock_guard_type lock(_queue_lock);
    _messageQueue.clear();
    _controlQueue.clear();
  }
  _server->_handleEvent(this, WS_EVT_DISCONNECT, NULL, NULL, 0);
}

void AsyncWebSocketClient::_clearQueue() {
  while (!_messageQueue.empty() && _messageQueue.front().finished()) {
    _messageQueue.pop_front();
  }
}

void AsyncWebSocketClient::_onAck(size_t len, uint32_t time) {
  _lastMessageTime = millis();

  asyncsrv::unique_lock_type lock(_queue_lock);

  async_ws_log_v("[%s][%" PRIu32 "] START ACK(%u, %" PRIu32 ") Q:%u", _server->url(), _clientId, len, time, _messageQueue.size());

  if (!_controlQueue.empty()) {
    auto &head = _controlQueue.front();
    if (head.finished()) {
      len -= head.len();
      if (_status == WS_DISCONNECTING && head.opcode() == WS_DISCONNECT) {
        _controlQueue.pop_front();
        _status = WS_DISCONNECTED;
        async_ws_log_v("[%s][%" PRIu32 "] ACK WS_DISCONNECTED", _server->url(), _clientId);
        // Capture _client before unlocking: _client->close() triggers the _onDisconnect() --> _handleDisconnect() --> ~AsyncWebSocketClient() chain,
        // so we must not access any member after unlock.
        AsyncClient *c = _client;
        if (c) {
          lock.unlock();
          c->close();
        }
        return;
      }
      _controlQueue.pop_front();
    }
  }

  if (len && !_messageQueue.empty()) {
    for (auto &msg : _messageQueue) {
      len = msg.ack(len, time);
      if (len == 0) {
        break;
      }
    }
  }

  _clearQueue();

  async_ws_log_v("[%s][%" PRIu32 "] END ACK(%u, %" PRIu32 ") Q:%u", _server->url(), _clientId, len, time, _messageQueue.size());

  _runQueue();
}

void AsyncWebSocketClient::_onPoll() {
  asyncsrv::unique_lock_type lock(_queue_lock);

  if (!_client) {
    return;
  }

  // A torn frame was detected during a previous _runQueue() call. We cannot
  // close from inside _runQueue: its callers hold _queue_lock, and close()
  // fires _onDisconnect which re-acquires _queue_lock (non-recursive → deadlock)
  // and would delete *this mid-iteration. Defer to here: unlock, then abort()
  // to send an RST (immediate reset, no TIME_WAIT).
  //
  // abort() synchronously fires the onDisconnect discard callback, which runs
  // _onDisconnect() (nulls _client and erases *this from the server's _clients
  // list, destroying this AsyncWebSocketClient) and then `delete c`s the
  // AsyncClient. We must NOT `delete c` ourselves here: that would double-free
  // the AsyncClient and corrupt the heap (esp-idf abort() always invokes the
  // discard cb when err != ERR_CONN; ERR_CONN means the pcb was already gone,
  // in which case the discard cb has already run and *this is already dead).
  if (_abortPending) {
    AsyncClient *c = _client;
    if (c) {
      lock.unlock();
      c->abort();  // fires onDisconnect → _onDisconnect() + delete c (full teardown)
    }
    return;
  }

  if (_client && _client->canSend() && (!_controlQueue.empty() || !_messageQueue.empty())) {
    _runQueue();
  } else if (_keepAlivePeriod > 0 && (millis() - _lastMessageTime) >= _keepAlivePeriod && (_controlQueue.empty() && _messageQueue.empty())) {
    lock.unlock();
    ping((uint8_t *)AWSC_PING_PAYLOAD, AWSC_PING_PAYLOAD_LEN);
  }
}

void AsyncWebSocketClient::_runQueue() {
  // all calls to this method MUST be protected by a mutex lock!
  if (!_client) {
    return;
  }
  if (_abortPending) {
    return;  // connection is being torn down; do not attempt further sends
  }

  _clearQueue();

  size_t space = webSocketSendFrameWindow(_client);

