ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
  if (space) {
    // control frames have priority over message frames
    // we can send a control frame if:
    // - there is no message frame in the queue, or the first message frame is between frames (all bytes sent are acked)
    // - the control frame is not finished (not sent yet)
    // - there is enough space to send the control frame (control frames are small, at most 129 bytes, so we can assume that if there is space to send it, it can be sent in one go)
    if (_messageQueue.empty() || _messageQueue.front().betweenFrames()) {
      for (auto &ctrl : _controlQueue) {
        if (ctrl.finished()) {
          continue;
        }
        if (space > (size_t)(ctrl.len() - 1)) {
          async_ws_log_v("[%s][%" PRIu32 "] SEND CTRL %" PRIu8, _server->url(), _clientId, ctrl.opcode());
          size_t sent = ctrl.send(_client);
          if (sent == WS_FRAME_TORN) {
            async_ws_log_e("[%s][%" PRIu32 "] TORN CTRL FRAME: scheduling abort", _server->url(), _clientId);
            _abortPending = true;
            _status = WS_DISCONNECTING;
            break;
          }
          space = webSocketSendFrameWindow(_client);
        }
      }
    }

    // then we can send message frames if there is space and no abort is pending
    if (!_abortPending && space) {
      for (auto &msg : _messageQueue) {
        if (msg._remainingBytesToSend()) {
          async_ws_log_v(
            "[%s][%" PRIu32 "][%" PRIu8 "] SEND %u/%u (acked: %u/%u)", _server->url(), _clientId, msg._opcode, msg._sent, msg._WSbuffer->size(), msg._acked,
            msg._ack
          );

          // will use all the remaining space, or all the remaining bytes to send, whichever is smaller
          msg.send(_client);
          space = webSocketSendFrameWindow(_client);

          if (msg._status == WS_MSG_ERROR) {
            async_ws_log_e("[%s][%" PRIu32 "] TORN FRAME: scheduling close", _server->url(), _clientId);
            _abortPending = true;
            _status = WS_DISCONNECTING;
            break;
          }

          // If we haven't finished sending this message, we must stop here to preserve WebSocket ordering.
          // We can only pipeline subsequent messages if the current one is fully passed to TCP buffer.
          if (msg._remainingBytesToSend()) {
            async_ws_log_v("[%s][%" PRIu32 "][%" PRIu8 "] NO_SPACE", _server->url(), _clientId, msg._opcode);
            break;
          }
        } else if (!space) {
          // not enough space for another message
          async_ws_log_v("[%s][%" PRIu32 "] NO_SPACE", _server->url(), _clientId);
          break;
        }
      }
    }
  }
}

bool AsyncWebSocketClient::queueIsFull() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return (_messageQueue.size() >= WS_MAX_QUEUED_MESSAGES) || (_status != WS_CONNECTED);
}

size_t AsyncWebSocketClient::queueLen() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return _messageQueue.size();
}

bool AsyncWebSocketClient::canSend() const {
  asyncsrv::lock_guard_type lock(_queue_lock);
  return _messageQueue.size() < WS_MAX_QUEUED_MESSAGES;
}

bool AsyncWebSocketClient::_queueControl(uint8_t opcode, const uint8_t *data, size_t len, bool mask) {
  asyncsrv::lock_guard_type lock(_queue_lock);

  if (!_client) {
    return false;
  }

  _controlQueue.emplace_back(opcode, data, len, mask);
  async_ws_log_v("[%s][%" PRIu32 "] QUEUE CTRL (%u) << %" PRIu8, _server->url(), _clientId, _controlQueue.size(), opcode);

  if (_client && _client->canSend()) {
    _runQueue();
  }

  return true;
}

bool AsyncWebSocketClient::_queueMessage(AsyncWebSocketSharedBuffer buffer, uint8_t opcode, bool mask) {
  asyncsrv::unique_lock_type lock(_queue_lock);

  if (!_client || !buffer || buffer->empty() || _status != WS_CONNECTED) {
    return false;
  }

  if (_messageQueue.size() >= WS_MAX_QUEUED_MESSAGES) {
    if (_closeWhenFull) {
      _status = WS_DISCONNECTED;

      async_ws_log_w("[%s][%" PRIu32 "] Too many messages queued: closing connection", _server->url(), _clientId);

      // Capture _client before unlocking: _client->close() triggers the _onDisconnect() --> _handleDisconnect() --> ~AsyncWebSocketClient() chain,
      // so we must not access any member after unlock.
      AsyncClient *c = _client;
      if (c) {
        lock.unlock();
        c->close();
      }

    } else {
      async_ws_log_w("[%s][%" PRIu32 "] Too many messages queued: discarding new message", _server->url(), _clientId);
    }

    return false;
  }

  _messageQueue.emplace_back(buffer, opcode, mask);
  async_ws_log_v("[%s][%" PRIu32 "] QUEUE MSG (%u/%u) << %" PRIu8, _server->url(), _clientId, _messageQueue.size(), WS_MAX_QUEUED_MESSAGES, opcode);

  if (_client && _client->canSend()) {
    _runQueue();
  }

  return true;
}

void AsyncWebSocketClient::close(uint16_t code, const char *message) {
  if (_status != WS_CONNECTED) {
    return;
  }

  async_ws_log_w("[%s][%" PRIu32 "] CLOSE", _server->url(), _clientId);

  _status = WS_DISCONNECTING;

  if (code) {
    uint8_t packetLen = 2;
    if (message != NULL) {
      size_t mlen = strlen(message);
      if (mlen > 123) {
        mlen = 123;
      }
      packetLen += mlen;
    }
    char *buf = (char *)malloc(packetLen);
    if (buf != NULL) {
      buf[0] = (uint8_t)(code >> 8);
      buf[1] = (uint8_t)(code & 0xFF);
      if (message != NULL) {
        memcpy(buf + 2, message, packetLen - 2);
      }
      _queueControl(WS_DISCONNECT, (uint8_t *)buf, packetLen);
      free(buf);
      return;
    } else {
      // Could not allocate the close-frame payload. We can't send a proper WS
      // close frame, so abort() to send an RST. abort() synchronously fires the
      // onDisconnect discard callback, which runs _onDisconnect() (erases *this
      // from the server's _clients, destroying this object) and `delete c`s the
      // AsyncClient. Do NOT `delete c` here: that would double-free it.
      // close() is unsuitable because it may be called with _queue_lock held.
      async_ws_log_e("Failed to allocate");
      AsyncClient *c = _client;
      if (c) {
        c->abort();  // fires onDisconnect → _onDisconnect() + delete c
      }
      return;
    }
  }
  _queueControl(WS_DISCONNECT);
}

bool AsyncWebSocketClient::ping(const uint8_t *data, size_t len) {
  return _status == WS_CONNECTED && _queueControl(WS_PING, data, len);
}

void AsyncWebSocketClient::_onError(int8_t err) {
  async_ws_log_v("[%s][%" PRIu32 "] ERROR %" PRIi8, _server->url(), _clientId, static_cast<int8_t>(err));
}

