ESP32Async/ESPAsyncWebServer/src/AsyncWebSocket.cpp
void AsyncWebSocketClient::_onTimeout(uint32_t time) {
  // Reads _client, then dereference it without any lock.
  // A concurrent _onDisconnect could null + delete the client between the check and the use.
  // Local capture ensures the pointer is read exactly once, eliminating the null-dereference.
  // (TOCTOU)
  AsyncClient *c = _client;
  if (!c) {
    return;
  }
  async_ws_log_v("[%s][%" PRIu32 "] TIMEOUT %" PRIu32, _server->url(), _clientId, time);
  c->close();
}

void AsyncWebSocketClient::_onDisconnect() {
  async_ws_log_v("[%s][%" PRIu32 "] DISCONNECT", _server->url(), _clientId);
  _status = WS_DISCONNECTED;
  {
    // Every queue method (_queueControl, _queueMessage, _runQueue, _onPoll, _onAck) reads _client while holding _queue_lock.
    // For those guarded reads to be meaningful, the write must also be synchronized. This doesn't change _queue_lock's purpose — it still guards queue integrity — but ensures the "is client alive?" checks that protect queue operations see a consistent value.
    asyncsrv::lock_guard_type lock(_queue_lock);
    _client = nullptr;
  }
  _server->_handleDisconnect(this);
}

void AsyncWebSocketClient::_onData(void *pbuf, size_t plen) {
  _lastMessageTime = millis();
  uint8_t *data = (uint8_t *)pbuf;

  while (plen > 0) {
    async_ws_log_v(
      "[%s][%" PRIu32 "] DATA plen: %" PRIu32 ", _pstate: %" PRIu8 ", _status: %" PRIu8, _server->url(), _clientId, static_cast<uint32_t>(plen), _pstate,
      static_cast<uint8_t>(_status)
    );

    if (_pstate == STATE_FRAME_START) {
      const uint8_t *fdata = data;

      _pinfo.index = 0;
      _pinfo.final = (fdata[0] & 0x80) != 0;
      _pinfo.opcode = fdata[0] & 0x0F;
      _pinfo.masked = ((fdata[1] & 0x80) != 0) ? 1 : 0;
      _pinfo.len = fdata[1] & 0x7F;

      data += 2;
      plen -= 2;

      if (_pinfo.len == 126 && plen >= 2) {
        _pinfo.len = fdata[3] | (uint16_t)(fdata[2]) << 8;
        data += 2;
        plen -= 2;

      } else if (_pinfo.len == 127 && plen >= 8) {
        _pinfo.len = fdata[9] | (uint16_t)(fdata[8]) << 8 | (uint32_t)(fdata[7]) << 16 | (uint32_t)(fdata[6]) << 24 | (uint64_t)(fdata[5]) << 32
                     | (uint64_t)(fdata[4]) << 40 | (uint64_t)(fdata[3]) << 48 | (uint64_t)(fdata[2]) << 56;
        data += 8;
        plen -= 8;
      }
    }

    async_ws_log_v(
      "[%s][%" PRIu32 "] DATA _pinfo: index: %" PRIu64 ", final: %" PRIu8 ", opcode: %" PRIu8 ", masked: %" PRIu8 ", len: %" PRIu64, _server->url(), _clientId,
      _pinfo.index, _pinfo.final, _pinfo.opcode, _pinfo.masked, _pinfo.len
    );

    // Handle fragmented mask data - Safari may split the 4-byte mask across multiple packets
    // _pinfo.masked is 1 if we need to start reading mask bytes
    // _pinfo.masked is 2, 3, or 4 if we have partially read the mask
    // _pinfo.masked is 5 if the mask is complete
    while (_pinfo.masked && _pstate <= STATE_FRAME_MASK && _pinfo.masked < 5) {
      // check if we have some data
      if (plen == 0) {
        // Safari close frame edge case: masked bit set but no mask data
        if (_pinfo.opcode == WS_DISCONNECT) {
          async_ws_log_v("[%s][%" PRIu32 "] DATA close frame with incomplete mask, treating as unmasked", _server->url(), _clientId);
          _pinfo.masked = 0;
          _pinfo.index = 0;
          _pinfo.len = 0;
          _pstate = STATE_FRAME_START;
          break;
        }

        // wait for more data
        _pstate = STATE_FRAME_MASK;
        async_ws_log_v("[%s][%" PRIu32 "] DATA waiting for more mask data: read: %" PRIu8 "/4", _server->url(), _clientId, _pinfo.masked - 1);
        return;
      }

      // accumulate mask bytes
      _pinfo.mask[_pinfo.masked - 1] = data[0];
      data += 1;
      plen -= 1;
      _pinfo.masked++;
    }

    // all mask bytes read if we were reading them
    _pstate = STATE_FRAME_DATA;

    // restore masked to 1 for backward compatibility
    if (_pinfo.masked >= 5) {
      async_ws_log_v("[%s][%" PRIu32 "] DATA mask read complete", _server->url(), _clientId);
      _pinfo.masked = 1;
    }

    const size_t datalen = std::min((size_t)(_pinfo.len - _pinfo.index), plen);

    if (_pinfo.masked) {
      for (size_t i = 0; i < datalen; i++) {
        data[i] ^= _pinfo.mask[(_pinfo.index + i) % 4];
      }
    }

    if (_pinfo.index == 0) {  // first fragment of the frame
      // init message_opcode for this frame
      // note: For next WS_CONTINUATION frames, they have opcode 0, so message_opcode will stay like the first frame
      if (_pinfo.opcode == WS_TEXT || _pinfo.opcode == WS_BINARY) {
        _pinfo.message_opcode = _pinfo.opcode;
      }
      // init frame number to 0 if only 1 frame or if this is the first frame of a fragmented message
      if (_pinfo.final || datalen < _pinfo.len) {
        _pinfo.num = 0;
      }
    }

    if ((datalen + _pinfo.index) < _pinfo.len) {  // more fragments to read for this frame
      _pstate = STATE_FRAME_DATA;

      if (datalen > 0) {
        async_ws_log_v(
          "[%s][%" PRIu32 "] DATA processing next fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
          (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
        );
        _handleDataEvent(data, datalen, datalen == plen);  // datalen == plen means that we are processing the last part of the current TCP packet
      }

      // track index for next fragment
      _pinfo.index += datalen;

    } else if ((datalen + _pinfo.index) == _pinfo.len) {  // this is the last fragment for this frame
      _pstate = STATE_FRAME_START;

      if (_pinfo.opcode == WS_DISCONNECT) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA WS_DISCONNECT", _server->url(), _clientId);

        if (datalen) {
          uint16_t reasonCode = (uint16_t)(data[0] << 8) + data[1];
          char *reasonString = (char *)(data + 2);
          if (reasonCode > 1001) {
            _server->_handleEvent(this, WS_EVT_ERROR, (void *)&reasonCode, (uint8_t *)reasonString, strlen(reasonString));
          }
        }
        if (_status == WS_DISCONNECTING) {
          _status = WS_DISCONNECTED;
          if (_client) {
            _client->close();
          }
        } else {
          _status = WS_DISCONNECTING;
          if (_client) {
            _client->ackLater();
          }
          _queueControl(WS_DISCONNECT, data, datalen);
        }

      } else if (_pinfo.opcode == WS_PING) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA PING", _server->url(), _clientId);
        _server->_handleEvent(this, WS_EVT_PING, NULL, NULL, 0);
        _queueControl(WS_PONG, data, datalen);

      } else if (_pinfo.opcode == WS_PONG) {
        async_ws_log_v("[%s][%" PRIu32 "] DATA PONG", _server->url(), _clientId);
        if (datalen != AWSC_PING_PAYLOAD_LEN || memcmp(AWSC_PING_PAYLOAD, data, AWSC_PING_PAYLOAD_LEN) != 0) {
          _server->_handleEvent(this, WS_EVT_PONG, NULL, NULL, 0);
        }

      } else if (_pinfo.opcode < WS_DISCONNECT) {  // continuation or text/binary frame
        async_ws_log_v(
          "[%s][%" PRIu32 "] DATA processing final fragment of %s frame %" PRIu32 ", index: %" PRIu64 ", len: %" PRIu32 "", _server->url(), _clientId,
          (_pinfo.message_opcode == WS_TEXT) ? "text" : "binary", _pinfo.num, _pinfo.index, (uint32_t)datalen
        );

        _handleDataEvent(data, datalen, datalen == plen);  // datalen == plen means that we are processing the last part of the current TCP packet

        if (_pinfo.final) {
          _pinfo.num = 0;
        } else {
          _pinfo.num += 1;
        }
      }

    } else {
      // unexpected frame error, close connection
      _pstate = STATE_FRAME_START;

      async_ws_log_v(
        "[%s][%" PRIu32 "] DATA frame error: len: %u, index: %" PRIu64 ", total: %" PRIu64 "\n", _server->url(), _clientId, datalen, _pinfo.index, _pinfo.len
      );

